#include "led.h"
/**************************************************************************
函数功能：LED接口初始化
入口参数：无 
返回  值：无
**************************************************************************/
void LED_Init(void)
{
RCC->APB2ENR|=1<<2; //使能 PORTA 时钟  
GPIOA->CRH&=0X0FFFFFFF;
GPIOA->CRH|=0X30000000;//PA15 推挽输出
GPIOA->ODR|=1<<15; //PA15 输出高
	
RCC->APB2ENR|=1<<3; //使能 PORTB 时钟  
GPIOB->CRH&=0XFF00FFFF;
GPIOB->CRH|=0X00330000;//PB13 推挽输出
	BUZZER=0;//默认关闭蜂鸣器
}

/**************************************************************************
函数功能：LED闪烁
入口参数：闪烁频率 
返回  值：无
**************************************************************************/
void Led_Flash(u16 time)
{
	  static int temp;
	  if(0==time) LED=0;
	  else		if(++temp==time)	LED=~LED,temp=0;
}
